// Вивести в консоль всі числа від 1 до 10 за допомогою циклу while.
let counter = 0;
while (counter < 10){
    console.log("counter:", counter);
    counter +=1 ;
}

//Вивести в консоль всі парні числа від 2 до 20 за допомогою циклу for. Якщо число парне, пропустити його за допомогою continue

for (let num = 2; num <= 20; num += 2) {
    console.log(num);
  }

//   Вивести в консоль таблицю множення числа 7 за допомогою циклу for.
const number = 7; 
for (let i = 1; i <= 10; i++) {
  console.log(`${number} × ${i} = ${number * i}`);
}

// Створити скрипт, який виводить в консоль всі числа , які менші за n. Якщо зустрічається число, що більше або дорівнює n, цикл повинен бути закінчений за допомогою break.
const n = 10;