// Вивести в консоль всі числа від 1 до 10 за допомогою циклу while.
let counter = 0;
while (counter < 10){
    console.log("counter:", counter);
    counter +=1 ;
}

//Вивести в консоль всі парні числа від 2 до 20 за допомогою циклу for. Якщо число парне, пропустити його за допомогою continue

for (let num = 2; num <= 20; num += 2) {
    console.log(num);
    continue;
  }

//   Вивести в консоль таблицю множення числа 7 за допомогою циклу for.
const number = 7; 
for (let i = 1; i <= 10; i++) {
  console.log(`${number} × ${i} = ${number * i}`);
}

// Створити скрипт, який виводить в консоль всі числа , які менші за n. Якщо зустрічається число, що більше або дорівнює n, цикл повинен бути закінчений за допомогою break.
const numbers = [3, 5, 7, 2, 8, 10, 1];
const n = 8;

for (let num of numbers) {
    if (num >= n) {
        break; 
    }
    console.log(num);
}
//За допомогою циклу while вивести в консоль всі числа від 1 до 20, крім чисел, кратних 3. Якщо зустрінете число, кратне 3, цикл повинен продовжити виконання за допомогою оператора continue.
let i = 1;
while (i <= 20) {
  if (i % 3 === 0) {
    continue;
  }
}
// console.log(i);
