// //Напиши скрипт, який об'єднує всі елементи массива в один рядок. Елементів може бути довільна кількість. Нехай елементи массива в рядку будут розділені комою.
// const friends = ['Mango', 'Poly', 'Kiwi', 'Ajax'];
// let string = '';
// string = friends.join(", ")
// console.log(string);

// //Працюємо з колекцією карток в trello. Метод splice() (можна використати інші методи)

// const cards = [
//     'Карточка-1',
//     'Карточка-2',
//     'Карточка-3',
//     'Карточка-4',
//     'Карточка-5',
//   ];
// cards.splice(2, 1,);// видалив карточку-3
// cards.push("Карточка-6");// додав карточку-6
// cards.splice(2, 1, "оновлена карточка-4")
// console.log(cards);

